<?php

declare(strict_types=1);
/**
 * This file is part of Hyperf.
 *
 * @link     https://www.hyperf.io
 * @document https://hyperf.wiki
 * @contact  group@hyperf.io
 * @license  https://github.com/hyperf/hyperf/blob/master/LICENSE
 */
return [
    'TIME_ZONE' => [
        '-12' => 'GMT -12:00',
        '-11' => 'GMT -11:00',
        '-10' => 'GMT -10:00',
        '-9.5' => 'GMT -9:30',   // 马克萨斯群岛
        '-9' => 'GMT -9:00',
        '-8' => 'GMT -8:00',
        '-7' => 'GMT -7:00',
        '-6' => 'GMT -6:00',
        '-5' => 'GMT -5:00',
        '-4' => 'GMT -4:00',
        '-3.5' => 'GMT -3:30',   // 纽芬兰
        '-3' => 'GMT -3:00',
        '-2' => 'GMT -2:00',
        '-1' => 'GMT -1:00',
        '0' => 'GMT 0:00',
        '1' => 'GMT +1:00',
        '2' => 'GMT +2:00',
        '3' => 'GMT +3:00',
        '3.5' => 'GMT +3:30',   // 伊朗
        '4' => 'GMT +4:00',
        '4.5' => 'GMT +4:30',   // 阿富汗
        '5' => 'GMT +5:00',
        '5.5' => 'GMT +5:30',   // 印度
        '5.75' => 'GMT +5:45',   // 尼泊尔
        '6' => 'GMT +6:00',
        '6.5' => 'GMT +6:30',   // 缅甸
        '7' => 'GMT +7:00',
        '8' => 'GMT +8:00',
        '9' => 'GMT +9:00',
        '9.5' => 'GMT +9:30',   // 澳大利亚中部
        '10' => 'GMT +10:00',
        '10.5' => 'GMT +10:30',   // 豪勋爵岛
        '11' => 'GMT +11:00',
        '12' => 'GMT +12:00',
        '12.75' => 'GMT +12:45',   // 查塔姆群岛
        '13' => 'GMT +13:00',   // 汤加、萨摩亚等
        '14' => 'GMT +14:00',   // 莱恩群岛
    ],
];
